brew "atuin"
brew "btop"
brew "fzf"
brew "git-delta"
brew "huggingface-cli"
brew "imagemagick"
brew "jj"
brew "jq"
brew "llm"
brew "neovim"
brew "nmap"
brew "node"
brew "pngquant"
brew "uv"
brew "wget"
brew "zoxide"
cask "1password-cli"
cask "ghostty"
cask "maccy"
cask "openrefine"
cask "rar"
vscode "antfu.slidev"
vscode "charliermarsh.ruff"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "tomoki1207.pdf"
vscode "vscodevim.vim"
