tap "huggingface/tap"
brew "atuin"
brew "bat"
brew "btop"
brew "csvkit"
brew "fzf"
brew "git-delta"
brew "go"
brew "huggingface-cli"
brew "imagemagick"
brew "iperf"
brew "jj"
brew "jq"
brew "llm"
brew "micromamba"
brew "neovim"
brew "nmap"
brew "node"
brew "pandoc"
brew "pngquant"
brew "poppler"
brew "pspg"
brew "python-tk@3.14"
brew "ruby"
brew "uv"
brew "wget"
brew "zoxide"
brew "huggingface/tap/git-xet"
cask "1password-cli"
cask "db-browser-for-sqlite"
cask "ghostty"
cask "maccy"
cask "openrefine"
cask "rar"
cask "xquartz"
vscode "antfu.slidev"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "google.colab"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "nvidia.nsight-vscode-edition"
vscode "percy.vscode-numpy-viewer"
vscode "tomoki1207.pdf"
vscode "unifiedjs.vscode-mdx"
vscode "vscodevim.vim"
